<a href="https://colab.research.google.com/github/enriqueasegura/Exercises/blob/master/HW3_PH_4200.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np   #matrix/array
import pandas as pd  #Data analysis
import matplotlib.pyplot as plt
%matplotlib inline
from sklearn import datasets

1. Construct a pandas series, ser1, whose values are 0.0, 0.5, 1.0, 1.5, …, 12.5 and whose index consists of the English alphabet a to z.
2. Construct ser2 with ten values which are random integers between 1 and 4 (included) and where the index is one, two, three, …, ten (words, not digits).
3. Construct series ser3 which consists of the part of ser2 where the values are greater than 2.
4. Construct series ser4 whose values are the exponential of the values in ser3.

In [0]:
import string

s_alphabet = string.ascii_lowercase
s_alphabet_list = list(s_alphabet)
# From a list

num_l = np.arange(0,13,.5)

ser1 = pd.Series(num_l, index=s_alphabet_list)
print('This is ser1: ')
ser1

This is ser1:

a     0.0
b     0.5
c     1.0
d     1.5
e     2.0
f     2.5
g     3.0
h     3.5
i     4.0
j     4.5
k     5.0
l     5.5
m     6.0
n     6.5
o     7.0
p     7.5
q     8.0
r     8.5
s     9.0
t     9.5
u    10.0
v    10.5
w    11.0
x    11.5
y    12.0
z    12.5
dtype: float64

In [0]:
rnd_num_l = [np.random.randint(1,4+1) for num in range(0,10)]
print('list of random numbers: ', rnd_num_l)

num_str_list = ["zero", "one", "two", "there", "four", "five", "six", "seven", "eight", "nine"]

print('Here it is ser2:')
ser2=pd.Series(rnd_num_l, index=num_str_list)
ser2

list of random numbers:  [3, 1, 2, 3, 2, 2, 1, 2, 3, 2]
Here it is ser2:

zero     3
one      1
two      2
there    3
four     2
five     2
six      1
seven    2
eight    3
nine     2
dtype: int64

In [0]:
#call module that does the change

filter_num_l = []
filter_num = 2
for num in ser2.values:
  if num > filter_num:
    filter_num_l.append(num)

ser3 = pd.Series(filter_num_l)
print('Here it is ser3:')
ser3

Here it is ser3:

0    3
1    3
2    3
dtype: int64

In [0]:
ser4 = np.exp(ser3)
print('Here it is ser4:')
ser4

Here it is ser4:

0    20.085537
1    20.085537
2    20.085537
dtype: float64

1. Use a dictionary to create a dataframe df with three columns and ten rows. The column names are: state, population, and area. Pick 10 US states and their population and area (in squared kilometers). Each row consists of the name of a state, its population, and its area.
2. After constructing df, change the index so the new index is the state column.
3. Add a new column called population density where the values are the number of people per squared kilometer.
4. Add a column called Abbrev where the values are the abbreviations of the states; for example, CA for California.
5. Drop two rows of your choice
6. Drop the Abbrev column
7. Use slicing to display rows number 3 through number 6.
8. Display the column called population.

In [0]:
state_l = ['New York', 'California', 'Illinois',
           'Texas', 'Arizona', 'Pennsylvania',
           'Texas', 'California', 'Texas', 'California']
popu_l = [8398748, 3990456, 2705994, 
          2325502, 1660272, 1584138,
          1532233, 1425976, 1345047, 1030119	]

area_l = [780.9, 1213.9, 588.7,
          1651.1, 1340.6, 347.6,
          1194.0, 842.3, 882.9,459.7]
speed_dict = {'State': state_l , 'Population': popu_l, 'Area (squared km)':area_l}

pd.Series(speed_dict)

State                [New York, California, Illinois, Texas, Arizon...
Population           [8398748, 3990456, 2705994, 2325502, 1660272, ...
Area (squared km)    [780.9, 1213.9, 588.7, 1651.1, 1340.6, 347.6, ...
dtype: object

In [0]:
df = pd.DataFrame(speed_dict, columns=['State', 'Population', 'Area (squared km)'])  
#df = df.set_index('State')   
print('Resulting Dataframe:')    
df

Resulting Dataframe:

          State  Population  Area (squared km)
0      New York     8398748              780.9
1    California     3990456             1213.9
2      Illinois     2705994              588.7
3         Texas     2325502             1651.1
4       Arizona     1660272             1340.6
5  Pennsylvania     1584138              347.6
6         Texas     1532233             1194.0
7    California     1425976              842.3
8         Texas     1345047              882.9
9    California     1030119              459.7

In [0]:
df = df.set_index('State')   
print('Dataframe with changed index:')
df

Dataframe with changed index:

              Population  Area (squared km)
State
New York         8398748              780.9
California       3990456             1213.9
Illinois         2705994              588.7
Texas            2325502             1651.1
Arizona          1660272             1340.6
Pennsylvania     1584138              347.6
Texas            1532233             1194.0
California       1425976              842.3
Texas            1345047              882.9
California       1030119              459.7

In [0]:
#add a new column that gives the population density 

df['Population Density per squared km'] = [10933, 3276, 4600,
                            1395, 1200, 4511,
                            1250, 1670, 1493, 2231]

df

              Population  Area (squared km)  Population Density per squared km
State
New York         8398748              780.9                              10933
California       3990456             1213.9                               3276
Illinois         2705994              588.7                               4600
Texas            2325502             1651.1                               1395
Arizona          1660272             1340.6                               1200
Pennsylvania     1584138              347.6                               4511
Texas            1532233             1194.0                               1250
California       1425976              842.3                               1670
Texas            1345047              882.9                               1493
California       1030119              459.7                               2231

In [0]:
#add column named Abbrev
df['Abbrev'] = ['NY', 'CA', 'IL',
                'TX', 'AZ', 'PA',
                'TX', 'CA', 'TX', 'CA']

df

              Population  ...  Abbrev
State                     ...
New York         8398748  ...      NY
California       3990456  ...      CA
Illinois         2705994  ...      IL
Texas            2325502  ...      TX
Arizona          1660272  ...      AZ
Pennsylvania     1584138  ...      PA
Texas            1532233  ...      TX
California       1425976  ...      CA
Texas            1345047  ...      TX
California       1030119  ...      CA

[10 rows x 4 columns]

In [0]:
#drop two rows of my choice
df = df[:-1]
print('dropping the last row of the initial dataframe:')
display(df)
print('repeat:')
df = df[:-1]
display(df)

dropping the last row of the initial dataframe:

              Population  ...  Abbrev
State                     ...
New York         8398748  ...      NY
California       3990456  ...      CA
Illinois         2705994  ...      IL
Texas            2325502  ...      TX
Arizona          1660272  ...      AZ
Pennsylvania     1584138  ...      PA
Texas            1532233  ...      TX
California       1425976  ...      CA
Texas            1345047  ...      TX

[9 rows x 4 columns]

repeat:

              Population  ...  Abbrev
State                     ...
New York         8398748  ...      NY
California       3990456  ...      CA
Illinois         2705994  ...      IL
Texas            2325502  ...      TX
Arizona          1660272  ...      AZ
Pennsylvania     1584138  ...      PA
Texas            1532233  ...      TX
California       1425976  ...      CA

[8 rows x 4 columns]

In [0]:
#drop abbrev column
df = df.drop('Abbrev', axis=1)
print('Resulting Dataframe:')
df

Resulting Dataframe:

              Population  Area (squared km)  Population Density per squared km
State
New York         8398748              780.9                              10933
California       3990456             1213.9                               3276
Illinois         2705994              588.7                               4600
Texas            2325502             1651.1                               1395
Arizona          1660272             1340.6                               1200
Pennsylvania     1584138              347.6                               4511
Texas            1532233             1194.0                               1250
California       1425976              842.3                               1670

In [0]:
print('Rows 3 to 6:')
df.iloc[3:7]

Rows 3 to 6:

              Population  Area (squared km)  Population Density per squared km
State
Texas            2325502             1651.1                               1395
Arizona          1660272             1340.6                               1200
Pennsylvania     1584138              347.6                               4511
Texas            1532233             1194.0                               1250

In [0]:
print('Population column:')
display(df.loc[:,'Population'])

Population column:

State
New York        8398748
California      3990456
Illinois        2705994
Texas           2325502
Arizona         1660272
Pennsylvania    1584138
Texas           1532233
California      1425976
Name: Population, dtype: int64

1. Construct a dataframe from a 5x5 numpy array of random numbers between 0 and 1. Take the index as a, b, c, d, e. The column names ae the default.
2. Now rename the columns to c1, c2, c3, c4, c5.
3. Display the first and 3rd columns.
4. Display the central 3x3 matrix
5. Give some demonstrations of the use of loc and iloc and explain the difference between them.
6. Add two new column c6 and c7 where the values in c6 are those in c1 minus those in c2, and the values in column c7 are those in c3 minus those in c4 minus those in c5.
7. Replace the negative numbers in columns c6 and c7 by NaN.
8. Replace the NaN’s by the mean of the rest of the values in the dataframe.

In [0]:
rnd_matrix = np.random.uniform(size=(5,5))

rnd_matrix

rnd_df = pd.DataFrame(rnd_matrix, index=['a', 'b', 'c', 'd','e'])
rnd_df

          0         1         2         3         4
a  0.948940  0.113859  0.291493  0.350138  0.662289
b  0.383145  0.981683  0.566025  0.566981  0.044841
c  0.664758  0.127719  0.824551  0.289920  0.366394
d  0.969274  0.755818  0.477349  0.749072  0.409417
e  0.408108  0.224584  0.913166  0.315248  0.633900

In [0]:
#rename columns

rnd_df = rnd_df.rename(columns={0: 'c1', 1:'c2', 2:'c3', 3:'c4', 4:'c5'})

rnd_df

         c1        c2        c3        c4        c5
a  0.948940  0.113859  0.291493  0.350138  0.662289
b  0.383145  0.981683  0.566025  0.566981  0.044841
c  0.664758  0.127719  0.824551  0.289920  0.366394
d  0.969274  0.755818  0.477349  0.749072  0.409417
e  0.408108  0.224584  0.913166  0.315248  0.633900

In [0]:
#display first and 3rd column
df_slice = rnd_df[['c1', 'c3']]
print('resulting slice:')
df_slice

resulting slice:

         c1        c3
a  0.948940  0.291493
b  0.383145  0.566025
c  0.664758  0.824551
d  0.969274  0.477349
e  0.408108  0.913166

In [0]:
print('3x3 matrix in the center:')
rnd_df.iloc[1:4, 1:4] 
#iloc works in the standard way a coordinate grid/matrix
#would work with the diference you have to add +1 to the end coordinate so it gives
#you the right coordinates given that it's of the form [start, end), in which end is not inclusive
#hence [start,end] = [start, end+1)

3x3 matrix in the center:

         c2        c3        c4
b  0.981683  0.566025  0.566981
c  0.127719  0.824551  0.289920
d  0.755818  0.477349  0.749072

In [0]:
# for me to use loc, from Prof's tutorial
# as seen in here, the difference is that I used the string label in the dataframe
# to slice through it, given that these are variable rather than index location as
# above
rnd_df.loc['b':'d', 'c2':'c4']

         c2        c3        c4
b  0.981683  0.566025  0.566981
c  0.127719  0.824551  0.289920
d  0.755818  0.477349  0.749072

In [0]:
rnd_df['c6'] = rnd_df['c1'] - rnd_df['c2']

rnd_df

         c1        c2        c3        c4        c5        c6
a  0.948940  0.113859  0.291493  0.350138  0.662289  0.835081
b  0.383145  0.981683  0.566025  0.566981  0.044841 -0.598538
c  0.664758  0.127719  0.824551  0.289920  0.366394  0.537039
d  0.969274  0.755818  0.477349  0.749072  0.409417  0.213456
e  0.408108  0.224584  0.913166  0.315248  0.633900  0.183524

In [0]:
rnd_df['c7'] = rnd_df['c3'] - rnd_df['c4'] - rnd_df['c5']

rnd_df

         c1        c2        c3        c4        c5        c6        c7
a  0.948940  0.113859  0.291493  0.350138  0.662289  0.835081 -0.720934
b  0.383145  0.981683  0.566025  0.566981  0.044841 -0.598538 -0.045797
c  0.664758  0.127719  0.824551  0.289920  0.366394  0.537039  0.168238
d  0.969274  0.755818  0.477349  0.749072  0.409417  0.213456 -0.681140
e  0.408108  0.224584  0.913166  0.315248  0.633900  0.183524 -0.035982

In [0]:
#replace values in data frame that are negative in c6 and c7 

rnd_df['c6'][rnd_df['c6'] < 0] = np.nan
rnd_df['c7'][rnd_df['c7'] < 0] = np.nan

rnd_df

         c1        c2        c3        c4        c5        c6        c7
a  0.948940  0.113859  0.291493  0.350138  0.662289  0.835081       NaN
b  0.383145  0.981683  0.566025  0.566981  0.044841       NaN       NaN
c  0.664758  0.127719  0.824551  0.289920  0.366394  0.537039  0.168238
d  0.969274  0.755818  0.477349  0.749072  0.409417  0.213456       NaN
e  0.408108  0.224584  0.913166  0.315248  0.633900  0.183524       NaN

In [0]:
#rnd_df['c6'][rnd_df['c6'] == np.nan] = np.mean(rnd_df['c6'])
#rnd_df['c7'][rnd_df['c7'] == np.nan] = np.mean(rnd_df['c7'])
# source :
# https://stackoverflow.com/questions/13295735/how-can-i-replace-all-the-nan-values-with-zeros-in-a-column-of-a-pandas-datafram

rnd_df['c6'] = rnd_df['c6'].replace(np.nan, np.mean(np.mean(rnd_df)))
rnd_df['c7'] = rnd_df['c7'].replace(np.nan, np.mean(np.mean(rnd_df)))
rnd_df

         c1        c2        c3        c4        c5        c6        c7
a  0.948940  0.113859  0.291493  0.350138  0.662289  0.835081  0.460249
b  0.383145  0.981683  0.566025  0.566981  0.044841  0.459750  0.460249
c  0.664758  0.127719  0.824551  0.289920  0.366394  0.537039  0.168238
d  0.969274  0.755818  0.477349  0.749072  0.409417  0.213456  0.460249
e  0.408108  0.224584  0.913166  0.315248  0.633900  0.183524  0.460249